; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v2)
		(pred_3 ?v4)
		(pred_5 ?v5)
		(pred_4 ?v5)
		(pred_2 ?v4 ?v5)
		(pred_1)
		(pred_6 ?v4))

   (:action op_2
       :parameters  (?v8 ?v7)
       :precondition (and (not-eq ?v8 ?v7) 
                          (pred_5 ?v8) (pred_5 ?v7) (pred_4 ?v8))
       :effect (and  (pred_4 ?v7)
		     (not (pred_4 ?v8))))


   (:action op_3
       :parameters (?v3 ?v1)
       :precondition  (and  (pred_3 ?v3) (pred_5 ?v1)
			    (pred_2 ?v3 ?v1) (pred_4 ?v1) (pred_1))
       :effect (and (pred_6 ?v3)
		    (not (pred_2 ?v3 ?v1)) 
		    (not (pred_1))))

   (:action op_1
       :parameters  (?v3  ?v1)
       :precondition  (and  (pred_3 ?v3) (pred_5 ?v1)
			    (pred_6 ?v3) (pred_4 ?v1))
       :effect (and (pred_2 ?v3 ?v1)
		    (pred_1)
		    (not (pred_6 ?v3)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_03 obj_04 obj_02 obj_08 obj_01 obj_05 
          obj_07 obj_06 
)
(:init
(pred_5 obj_03)
(pred_5 obj_04)
(pred_5 obj_02)
(pred_5 obj_08)
(pred_5 obj_01)
(pred_5 obj_05)
(pred_3 obj_07)
(pred_3 obj_06)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(pred_1)
(pred_2 obj_07 obj_08)
(pred_2 obj_06 obj_05)
(pred_4 obj_01)
)
(:goal
(and
(pred_2 obj_07 obj_01)
(pred_2 obj_06 obj_05)
)
)

(:constraints
  (sometime-before  (pred_2 obj_07 obj_01) (pred_4 obj_03))
)
)

; plan
1. (op_2 obj_01 obj_08)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_08)
   goals met: 1 of 2
2. (op_3 obj_07 obj_08)
   deleted: (pred_2 obj_07 obj_08) (pred_1)
   added: (pred_6 obj_07)
   goals met: 1 of 2
3. (op_2 obj_08 obj_05)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_05)
   goals met: 1 of 2
4. (op_1 obj_07 obj_05)
   deleted: (pred_6 obj_07)
   added: (pred_2 obj_07 obj_05) (pred_1)
   goals met: 1 of 2
5. (op_3 obj_06 obj_05)
   deleted: (pred_2 obj_06 obj_05) (pred_1)
   added: (pred_6 obj_06)
   goals met: 0 of 2
6. (op_2 obj_05 obj_03)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_03)
   goals met: 0 of 2
7. (op_1 obj_06 obj_03)
   deleted: (pred_6 obj_06)
   added: (pred_2 obj_06 obj_03) (pred_1)
   goals met: 0 of 2
8. (op_2 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_05)
   goals met: 0 of 2
9. (op_3 obj_07 obj_05)
   deleted: (pred_2 obj_07 obj_05) (pred_1)
   added: (pred_6 obj_07)
   goals met: 0 of 2
10. (op_2 obj_05 obj_01)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_01)
   goals met: 0 of 2
11. (op_1 obj_07 obj_01)
   deleted: (pred_6 obj_07)
   added: (pred_2 obj_07 obj_01) (pred_1)
   goals met: 1 of 2
12. (op_2 obj_01 obj_03)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_03)
   goals met: 1 of 2
13. (op_3 obj_06 obj_03)
   deleted: (pred_2 obj_06 obj_03) (pred_1)
   added: (pred_6 obj_06)
   goals met: 1 of 2
14. (op_2 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_05)
   goals met: 1 of 2
15. (op_1 obj_06 obj_05)
   deleted: (pred_6 obj_06)
   added: (pred_2 obj_06 obj_05) (pred_1)
   goals met: 2 of 2
